#include "stdio.h"
#include "stdlib.h"
int main()
{
int a=1,x1,x2,x3,x4,x5,x6,x7,x8,x9,x10,x;
printf("请输入一个不超过10位的整数:");
scanf("%d",&x);
x10=x/1000000000;
x9=(x-x10*1000000000)/100000000;
x8=(x-x10*1000000000-x9*100000000)/10000000;
x7=(x-x10*1000000000-x9*100000000-x8*10000000)/1000000;
x6=(x-x10*1000000000-x9*100000000-x8*10000000-x7*1000000)/100000;
x5=(x-x10*1000000000-x9*100000000-x8*10000000-x7*1000000-x6*100000)/10000;
x4=(x-x10*1000000000-x9*100000000-x8*10000000-x7*1000000-x6*100000-x5*10000)/1000;
x3=(x-x10*1000000000-x9*100000000-x8*10000000-x7*1000000-x6*100000-x5*10000-x4*1000)/100;
x2=(x-x10*1000000000-x9*100000000-x8*10000000-x7*1000000-x6*100000-x5*10000-x4*1000-x3*100)/10;
x1= x-x10*1000000000-x9*100000000-x8*10000000-x7*1000000-x6*100000-x5*10000-x4*1000-x3*100-x2*10;
while(x>=10)
{
	a++;
	x=x/10;
}
printf("这个数字是%d位数\n",a);
if(a==10) 			printf("顺序输出为%d%d%d%d%d%d%d%d%d%d,逆序输出为%d%d%d%d%d%d%d%d%d%d",x10,x9,x8,x7,x6,x5,x4,x3,x2,x1,x1,x2,x3,x4,x5,x6,x7,x8,x9,x10);
else if(a==9)		printf("顺序输出为%d%d%d%d%d%d%d%d%d,逆序输出为%d%d%d%d%d%d%d%d%d",x9,x8,x7,x6,x5,x4,x3,x2,x1,x1,x2,x3,x4,x5,x6,x7,x8,x9);
else if(a==8)		printf("顺序输出为%d%d%d%d%d%d%d%d,逆序输出为%d%d%d%d%d%d%d%d",x8,x7,x6,x5,x4,x3,x2,x1,x1,x2,x3,x4,x5,x6,x7,x8);
else if(a==7)		printf("顺序输出为%d%d%d%d%d%d%d%,逆序输出为%d%d%d%d%d%d%d%",x7,x6,x5,x4,x3,x2,x1,x1,x2,x3,x4,x5,x6,x7);
else if(a==6)		printf("顺序输出为%d%d%d%d%d%d,逆序输出为%d%d%d%d%d%d",x6,x5,x4,x3,x2,x1,x1,x2,x3,x4,x5,x6);
else if(a==5)		printf("顺序输出为%d%d%d%d%d,逆序输出为%d%d%d%d%d",x5,x4,x3,x2,x1,x1,x2,x3,x4,x5);
else if(a==4)		printf("顺序输出为%d%d%d%d,逆序输出为%d%d%d%d%d",x4,x3,x2,x1,x1,x2,x3,x4);
else if(a==3)		printf("顺序输出为%d%d%d,逆序输出为%d%d%d",x3,x2,x1,x1,x2,x3);
else if(a==2) 		printf("顺序输出为%d%d,逆序输出为%d%d",x2,x1,x1,x2);
else if(a==1) 		printf("顺序输出为%d,逆序输出为%d",x1,x1);
else				printf("请检查输入！") ; 
printf("\n");
system("pause");
}
